NewBlog/app/views/posts/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label :category_id %>
    <%= form.collection_select(:category_id, Category.all, :id, :name) %>